{
    "skills": "Habilitats",

    "introduction": "No sé tocar el saxofon, però sé fer servir un ordinador, i a banda de suggerir-te que reiniciïs l'ordinador, tinc altres habilitats.",

    "python": "Python",
    "python_text": "He fet servir Python per construir API REST (principalment amb FastAPI), scripts de sistema, algoritmes de criptografia, aprenentatge computacional, connectar amb bases de dades, analitzar dades... Estic familiaritzat amb les biblioteques habituals per a aquests casos.",

    "javascript": "JavaScript",
    "javascript_text": "Principalment l'he utilitzat per a projectes de front-end, tant sense cap framework (vanilla) com amb React. Encara que també conec Express.Js com a opció per crear API.",

    "html_css": "HTML i CSS",
    "html_css_text": "Són la base per crear pàgines web i el front-end a aplicacions web, i tinc experiència fent pàgines web a partir de frameworks CSS com ara Bootstrap, o creant les meves pròpies biblioteques CSS.",

    "java": "Java",
    "java_text": "Aquest llenguatge m'ha permès crear aplicacions de xarxa i escriptori. Durant els estudis d'enginyeria informàtica, aquest era el llenguatge més freqüent.",

    "kotlin": "Kotlin",
    "kotlin_text": "És el llenguatge prioritari per crear aplicacions natives en Android, i és en aquest àmbit on l'he utilitzat. Podeu veure el codi d'un parell de projectes publicats a la botiga d'Android a GitHub.",

    "databases": "Bases de dades",
    "databases_text": "He utilitzat bases de dades SQL com SQLite, PostgreSQL o MariaDB, però també he realitzat algunes pràctiques amb Firebase/Firestore com a base de dades no relacional.",

    "linux": "Linux",
    "linux_text": "És el meu sistema operatiu d'ús habitual. A més, tinc formació addicional com a administrador de sistemes Linux i ho he fet servir no només com a sistema d'escriptori sinó en context de servidor.",

    "git": "Git",
    "git_text": "Habitualment utilitzo Git com a sistema de control de versions en els projectes que realitzo, i estic familiaritzat amb les funcionalitats com l'ús de branchs i tags per a una millor organització. També l'he fet servir juntament amb GitHub o GitLab.",

    "security": "Seguretat",
    "security_text": "Estic conscienciat amb la necessitat de desenvolupar de manera segura, tenint en compte els usos erronis o malintencionats d'una aplicació o servei, i per això també disposo de formació addicional en aquest camp.",

    "webdev": "Desenvolupament web",
    "webdev_text": "Durant les meves pràctiques a l'empresa i al treball de final de grau he desenvolupat tant el front-end com el back-end d'aplicacions web, així com en projectes personals. Tant en vanilla JavaScript com usant la biblioteca React.",

    "mobiledev": "Desenvolupament mòbil",
    "mobiledev_text": "He publicat projectes a la botiga d'aplicacions d'Android, i tinc formació en desenvolupament mòbil fent servir Kotlin i React Native.",

    "learning": "Capacitat d'aprenentatge",
    "learning_text":  "La formació de base àmplia, amb el grau en Enginyeria Informàtica, demostra comprensió profunda sobre allò que faig, i la meva història laboral acredita el reciclatge continu, l'adaptació al canvi i la meva disposició per afrontar nous reptes."
    

}